<?php

return [
    'blocks' => [
        'does_not_exist' => 'Заголовок "%s" не знайдено в тексті!',
        'size_from' => 'Блок "%s" занадто короткий, довжина - %s, необхідна довжина - від %s',
        'size_to' => 'Блок "%s" занадто довгий, довжина - %s, необхідна довжина - до %s'
    ],
    'plan' => [
        'size_from' => 'Текст занадто короткий, довжина - %s, необхідна довжина - від %s',
        'size_to' => 'Текст занадто довгий, довжина - %s, необхідна довжина - до %s'
    ],
    'settings' => [
        'DisallowTitle3NextToTitle2' => 'Заборонено використовувати заголовок H3 після заголовоку H2 без розділюючого тексту - "%s"',
        'MinimumNumberOfLettersInTheParagraph' => 'Параграф "%s" занадто короткий, довжина - %s, необхідна довжина - від %s',
        'MaximumNumberOfLettersInTheParagraph' => 'Параграф "%s" занадто довгий, довжина - %s, необхідна довжина - до %s',
        'MinimumNumberOfLettersInTheTitle' => 'Заголовок "%s" занадто короткий, довжина - %s, необхідна довжина - від %s',
        'MaximumNumberOfLettersInTheTitle' => 'Заголовок "%s" занадто довгий, довжина - %s, необхідна довжина - до %s'
    ],
    'keys' => [
        'more' => 'У блоці "%s" помилка у кількості входжень ключа "%s", кількість - %s, необхідна кількість - до %s',
        'less' => 'У блоці "%s" помилка у кількості входжень ключа "%s", кількість - %s, необхідна кількість - від %s'
    ],
    'setting_blocks' => [
        'more' => 'У блоці "%s" помилка у кількості використань "%s", кількість - %s, необхідна кількість - до %s',
        'less' => 'У блоці "%s" помилка у кількості використань "%s", кількість - %s, необхідна кількість - від %s'
    ]
];
